cask_args appdir: '~/Applications'

# Install homebrew taps
tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'homebrew/binary'
tap 'homebrew/dupes'
tap 'homebrew/versions'
tap 'thoughtbot/formulae'

# Install 'homebrew' packages
brew 'ack'
brew 'autojump'
brew 'bats'
brew 'chkrootkit'
brew 'chromedriver'
brew 'cmake'
brew 'dlite'
brew 'dockutil'
brew 'elixir'
brew 'emacs', args: ['with-cocoa', 'with-gnutls']
brew 'ffmpeg'
brew 'gifify'
brew 'git-extras'
brew 'git'
brew 'golang'
brew 'graphviz'
brew 'htop-osx'
brew 'hub'
brew 'icu4c'
brew 'imagemagick'
brew 'ios-webkit-debug-proxy'
brew 'jenkins-lts'
brew 'jq'
brew 'lynis'
brew 'mas'
brew 'nodejs'
brew 'parallel'
brew 'phantomjs'
brew 'pkg-config'
brew 'pwgen'
brew 'rbenv'
brew 'rcm'
brew 'rename'
brew 'rkhunter'
brew 'rsync'
brew 'ruby-install'
brew 'saltstack'
brew 'shellcheck'
brew 'source-highlight'
brew 'sslyze'
brew 'tesseract'
brew 'tidy-html5'
brew 'tig'
brew 'tmux-cssh'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'

# Install apps with brew-cask
cask 'adium'
cask 'alfred'
cask 'atom'
cask 'appcleaner'
cask 'audacity'
cask 'caffeine'
cask 'clipmenu'
cask 'cord'
cask 'dash'
cask 'dropbox'
cask 'flux'
cask 'firefox'
cask 'freemind'
#  cask 'fuze'
cask 'gephi'
cask 'gif-for-mac'
cask 'google-chrome'
cask 'google-drive'
cask 'google-hangouts'
cask 'google-refine'
cask 'gpgtools'
cask 'handbrake'
cask 'imageoptim'
cask 'iterm2'
cask 'java' unless system '/usr/libexec/java_home --failfast'
cask 'kdiff3'
cask 'keepassx'
cask 'launchcontrol'
cask 'libreoffice'
cask 'limechat'
cask 'moom'
cask 'nvalt'
cask 'owasp-zap'
cask 'packer'
cask 'pandoc'
cask 'pencil'
cask 'postico'
cask 'sequel-pro'
cask 'sweet-home3d'
cask 'teamviewer'
cask 'telegram'
cask 'the-unarchiver'
cask 'tunnelblick'
# cask 'typinator' # This installs the latest version, wee need 5.9
cask 'vagrant'
cask 'vlc'
cask 'virtualbox'
cask 'vault'
cask 'xquartz'
cask 'firefox'
cask 'telegram'
cask 'firefox'

# Install quicklook plugins with brew-cask (https://github.com/sindresorhus/quick-look-plugins)
cask 'betterzipql'
cask 'qlcolorcode'
cask 'qlimagesize'
cask 'qlmarkdown'
cask 'qlprettypatch'
cask 'qlstephen'
cask 'quicklook-csv'
cask 'quicklook-json'
cask 'suspicious-package'
cask 'webpquicklook'

# Install fonts
cask 'font-inconsolata-dz-for-powerline'
cask 'font-inconsolata'
cask 'font-meslo-lg-for-powerline'
cask 'font-ubuntu'

# Install from App Store
mas '1Password', id: 443987910
mas 'Affinity Designer', id: 824171161
mas 'Affinity Photo', id: 824183456
mas 'CCMenu', id: 603117688
mas 'Dash', id: 458034879
mas 'Day One Classic', id: 422304217
mas 'GarageBand', id: 682658836
mas 'Growl', id: 467939042
mas 'iMovie', id: 408981434
mas 'Install OS X Yosemite', id: 915041082
mas 'Integrity', id: 513610341
mas 'Keynote', id: 409183694
mas 'Monodraw', id: 920404675
mas 'Monosnap', id: 540348655
mas 'Name Mangler', id: 402434720
mas 'Numbers', id: 409203825
mas 'OmniOutliner Pro', id: 404647179
mas 'Pages', id: 409201541
mas 'Pocket', id: 568494494
mas 'ScreenFlow', id: 422025166
mas 'Scrivener', id: 418889511
mas 'Slack', id: 803453959
mas 'SomaFM', id: 449155338
mas 'The Unarchiver', id: 425424353
mas 'Tweetbot', id: 557168941
mas 'Xcode', id: 497799835
